---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarCoupler.GetPointsForPlacement
source: html/c270a509-8e1d-8e13-2176-d3680045dbe4.htm
---
# Autodesk.Revit.DB.Structure.RebarCoupler.GetPointsForPlacement Method

gets the point (or points in case of rebar set) where the coupler is placed

## Syntax (C#)
```csharp
public IList<XYZ> GetPointsForPlacement()
```